---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CouplerWeight
source: html/c1688882-1d80-9c48-b6f4-f3ee29a98b44.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CouplerWeight Property

"Mass"

## Syntax (C#)
```csharp
public static ForgeTypeId CouplerWeight { get; }
```